Revit 2024 API
FlexPipe.IsFlexPipeTypeId Method
 Checks if given type is valid flexible pipe type.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool IsFlexPipeTypeId(
	Document document,
	ElementId pipeTypeId
)
Visual Basic
Public Shared Function IsFlexPipeTypeId ( _
	document As Document, _
	pipeTypeId As ElementId _
) As Boolean
Visual C++
public:
static bool IsFlexPipeTypeId(
	Document^ document,
	ElementId^ pipeTypeId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
pipeTypeId
Type: Autodesk.Revit.DB.ElementId
 ElementId of the flexible pipe type to check.
Return Value
 True if flexible pipe type can used for this pipe, false otherwise.
Remarks
 A type is valid for flexible pipe if it can be used to the flexible pipe element.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FlexPipe Class
Autodesk.Revit.DB.Plumbing Namespace